app/Models/OptionModel.php

    public function getOptions(): array
    {
        return $this->orderBy('prix', 'ASC')->findAll();
---
SELECT *
FROM `Option`
ORDER BY `prix` ASC

    public function purchaseOptionForUser(int $optionId, int $userId): array
    {
        $option = $this->find($optionId);
        if (!$option) {
            return ['success' => false, 'message' => 'Option introuvable.'];
        }

        $userModel = new UserModel();
        $user = $userModel->findUserById($userId);
        if (!$user) {
            return ['success' => false, 'message' => 'Utilisateur introuvable.'];
        }

        $optionUserModel = new OptionUserModel();
        $existing = $optionUserModel
            ->where('idUser', $userId)
            ->where('idOption', $optionId)
            ->first();
---
SELECT *
FROM `Option`
WHERE `Option`.`id` = 1
SELECT *
FROM `OptionUser`
WHERE `idUser` = 2
AND `idOption` = 1
 LIMIT 1

        $db = $this->db;
        $db->transStart();

        $userModel->update($userId, ['balance' => $balance - $price]);
        $optionUserModel->insert([
            'idUser' => $userId,
            'idOption' => $optionId
        ]);
---
UPDATE `User` SET `balance` = 10.01
WHERE `User`.`id` IN (2)
INSERT INTO `OptionUser` (`idUser`, `idOption`) VALUES (2, 1)